namespace SalesInput.View
{
    partial class UpdateMessage
    {
        /// <summary>
        /// Required designer variable.
        /// </summary>
        private System.ComponentModel.IContainer components = null;

        /// <summary>
        /// Clean up any resources being used.
        /// </summary>
        /// <param name="disposing">true if managed resources should be disposed; otherwise, false.</param>
        protected override void Dispose(bool disposing)
        {
            if (disposing && (components != null))
            {
                components.Dispose();
            }
            base.Dispose(disposing);
        }

        #region Windows Form Designer generated code

        /// <summary>
        /// Required method for Designer support - do not modify
        /// the contents of this method with the code editor.
        /// </summary>
        private void InitializeComponent()
        {
            this.listBox1 = new System.Windows.Forms.ListBox();
            this.SuspendLayout();
            // 
            // listBox1
            // 
            this.listBox1.Font = new System.Drawing.Font("微軟正黑體", 12F, System.Drawing.FontStyle.Regular, System.Drawing.GraphicsUnit.Point, ((byte)(136)));
            this.listBox1.FormattingEnabled = true;
            this.listBox1.ItemHeight = 20;
            this.listBox1.Items.AddRange(new object[] {
            "2020/05/13 V2.7.4",
            "--------------------------------------------------------",
            "1.修改新竹貨運總表指配日時間",
            "",
            "2020/03/31 V2.7.3",
            "--------------------------------------------------------",
            "1.新增揀貨單匯出功能",
            "",
            "2020/02/19 V2.7.2",
            "--------------------------------------------------------",
            "1.調撥單明細，設定每頁為12筆",
            "",
            "2019/11/22 V2.7.2",
            "--------------------------------------------------------",
            "1.修正調撥單排序",
            "",
            "2019/10/25 V2.7.2",
            "--------------------------------------------------------",
            "1.增加判斷封箱時數量一定要超過0，才能轉單",
            "",
            "",
            "2019/10/03 V2.7.2",
            "--------------------------------------------------------",
            "1.修正代寄客缺貨-會出錯",
            "",
            "2019/10/03 V2.7.1",
            "--------------------------------------------------------",
            "1.修正銷貨單總金額計算到小數點第二位",
            "",
            "",
            "2019/09/02 V2.7.1",
            "--------------------------------------------------------",
            "1.修正調撥單補單備註不會預帶單號",
            "",
            "",
            "2019/09/02 V2.7",
            "--------------------------------------------------------",
            "1.新增進貨單連續套表",
            "2.代寄客增加紀錄新竹貨運追蹤碼欄位",
            "",
            "2019/04/30 V2.6",
            "--------------------------------------------------------",
            "1.銷貨單調撥日期BUG修正",
            "",
            "2019/02/21 V2.5",
            "--------------------------------------------------------",
            "1.修正代寄客可以條碼搜尋",
            "2.代寄客下載修正可全選",
            "3.揀貨系統補轉單分倉修正",
            "",
            "2019/01/02 V2.3",
            "--------------------------------------------------------",
            "1.揀貨系統，調整為標籤紙列印，封箱後馬上印出明細，",
            "轉調撥單，並開立新竹出貨單，另外分倉28開頭會以MAIL通知",
            "相關人員，並增加近期20二十筆。",
            "",
            "2.銷貨單數量總計修改。",
            "",
            "3.代寄客報表依儲位排序。",
            "",
            "4.儲位登錄系統，新增\"連續新增\"功能。",
            "",
            "",
            "2018/11/26 V2.2.3",
            "--------------------------------------------------------",
            "1.撿貨模式，直接增加銷貨單及調撥單的選項，調撥單",
            "封箱直接轉調撥單與出貨單銷貨單則與之前模式相同。",
            "",
            "2.代寄客轉單增加判斷網路狀況及解決重覆轉單情況。",
            "",
            "2018/09/26 V2.2.2",
            "--------------------------------------------------------",
            "1.銷補揀貨,重覆確認下載狀態。",
            "",
            "",
            "2018/07/20 V2.2.1",
            "--------------------------------------------------------",
            "1.修正缺貨未更新bug。",
            "",
            "2018/07/20 V2.2",
            "--------------------------------------------------------",
            "1.新增銷貨單轉單。",
            "",
            "",
            "2018/07/17 V2.1.1",
            "--------------------------------------------------------",
            "1.儲位系統調整。",
            "2.平板撿貨調撥單號調整。",
            "",
            "2018/07/15 V2.1",
            "--------------------------------------------------------",
            "1.字型調整。",
            "",
            "2018/07/13 V2.0",
            "--------------------------------------------------------",
            "1.新增代寄客系統。",
            "2.封箱完畢，差異量回傳。",
            "3.調撥單加上條碼。",
            "",
            "2017/11/10 V1.9",
            "--------------------------------------------------------",
            "1.明確給調撥說明01，防止作廢單。",
            "",
            "",
            "2017/9/28 V1.8",
            "--------------------------------------------------------",
            "1.修正調撥單轉單同型號顏色，明細會分開。",
            "2.吊牌列印，牌價不帶小數點。",
            "",
            "2017/9/28 V1.7",
            "--------------------------------------------------------",
            "1.修正揀貨計時問題。",
            "",
            "2017/9/22 V1.6",
            "--------------------------------------------------------",
            "1.修正網路不穩時，轉調撥只有表頭沒有表身。",
            "",
            "2017/9/15 V1.5",
            "--------------------------------------------------------",
            "1.修正揀貨時直接取消，再去揀第二家會造成錯誤bug。",
            "2.轉單畫面增加判斷是否已列印轉單CheckBox。",
            "3.揀貨增加計時機制。",
            "4.異動資料表Table。",
            "",
            "2017/9/8 V1.4",
            "--------------------------------------------------------",
            "1.連續套表新增「調撥單」。",
            "2.微調版本更新訊息提示。",
            "",
            "2017/9/7 V1.3",
            "--------------------------------------------------------",
            "1.修正同樣商品刷在不同箱，會出現數量差異。",
            "2.版本差異提示。",
            "3.取消轉單，每轉一張單出現訊息提示。",
            "",
            "2017/9/5 V1.2",
            "--------------------------------------------------------",
            "1.禁止雙開。",
            "2.修正同時揀兩筆揀貨單據封箱影響轉單bug。",
            "3.優化系統常出現系統\"無法回應訊息\"。",
            "4.修正調撥單合計數量與表身數量不符bug。",
            "5.增加更新日期及更新內容顯示。"});
            this.listBox1.Location = new System.Drawing.Point(0, 0);
            this.listBox1.Name = "listBox1";
            this.listBox1.ScrollAlwaysVisible = true;
            this.listBox1.Size = new System.Drawing.Size(520, 344);
            this.listBox1.TabIndex = 0;
            // 
            // UpdateMessage
            // 
            this.AutoScaleDimensions = new System.Drawing.SizeF(6F, 12F);
            this.AutoScaleMode = System.Windows.Forms.AutoScaleMode.Font;
            this.ClientSize = new System.Drawing.Size(520, 352);
            this.Controls.Add(this.listBox1);
            this.FormBorderStyle = System.Windows.Forms.FormBorderStyle.FixedToolWindow;
            this.Name = "UpdateMessage";
            this.Padding = new System.Windows.Forms.Padding(10);
            this.Text = "系統更新資訊";
            this.ResumeLayout(false);

        }

        #endregion

        private System.Windows.Forms.ListBox listBox1;
    }
}